{
  "backend/main.mo": "Motoko actor defining the church backend with persistent storage for mass schedule, prayers, media gallery, spiritual message, and announcements. Exposes CRUD query and update functions for each data type.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (landing page sections, visual theme, scroll-aware navbar, etc.) to their corresponding frontend/backend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing short summaries for three frontend files: the admin media gallery manager, the announcements manager, and the blob-storage TypeScript ambient declaration.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property design tokens (colors, radius, chart colors) for both light and dark themes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to the church name and mounting the app via the /src/main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with three routes: the public landing page (/), admin login (/admin/login), and a protected admin dashboard (/admin).",
  "frontend/src/components/admin/AnnouncementsManager.tsx": "Admin form for creating and updating the site announcement banner, with fields for text, event date, and active toggle, persisting draft state to localStorage and saving via a mutation.",
  "frontend/src/components/admin/MassScheduleManager.tsx": "Admin panel for adding new mass timings (day, time, service type) and displaying the existing schedule, with draft persistence and success/error feedback.",
  "frontend/src/components/admin/MediaGalleryManager.tsx": "Admin media gallery manager supporting bulk image/video file uploads (converted to data URLs) and YouTube URL additions, with per-item caption editing, progress tracking, and tab-based UI.",
  "frontend/src/components/admin/SpiritualMessageManager.tsx": "Admin form for editing the daily spiritual message (title, author, full text) with localStorage draft persistence, load-from-saved functionality, and save via mutation.",
  "frontend/src/components/AnnouncementsBanner.tsx": "Fixed top banner component that fetches and displays the active church announcement with an event date badge, a pulsing bell icon, and a dismiss button.",
  "frontend/src/components/DonationCTA.tsx": "Scroll-animated donation section with a pulsing gold 'Donate Online' button, a scripture quote, rosary imagery, and a fallback message directing visitors to the parish office.",
  "frontend/src/components/Footer.tsx": "Site footer with three columns covering church info/logo, smooth-scroll quick links, and location details including Sunday mass times and a Google Maps link.",
  "frontend/src/components/GoogleMap.tsx": "Renders a 'Find Us' section with a map placeholder linking to Google Maps and contact info cards (address, phone, email) for Holy Rosary Catholic Church in Nellore, with scroll-triggered fade-in animation.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a church background image, overlay, church name in Telugu and English, a tagline, and CTA buttons for Mass Schedule and location, with scroll-triggered animation.",
  "frontend/src/components/MassSchedule.tsx": "Displays the church's mass schedule fetched via React Query, sorted by day and time, rendered as color-coded cards with loading skeletons and an empty state.",
  "frontend/src/components/MediaGallery.tsx": "Renders a photo/video gallery fetched via React Query in a responsive grid, supporting YouTube video thumbnails and a lightbox modal for full-size viewing.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar that becomes opaque on scroll, with smooth-scroll links for main sections, a desktop nav and a collapsible mobile menu, and an Admin link.",
  "frontend/src/components/PrayerModule.tsx": "Accordion-style prayer browser with Telugu/English language toggle and search filtering, fetching prayers via React Query and expanding individual prayer content on click.",
  "frontend/src/components/SectionHeader.tsx": "Reusable section header component that renders a centered title, optional subtitle, and decorative gold divider with a cross icon. Supports a light color variant for use on dark backgrounds.",
  "frontend/src/components/SpiritualMessage.tsx": "Displays the daily spiritual message section with a dark gradient background, showing a preview of the message fetched via React Query and a button to open the full message in a modal.",
  "frontend/src/components/SpiritualMessageModal.tsx": "Modal overlay component that displays the full text of a spiritual message with author, formatted date, and close controls, locking body scroll while open.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useDraftState.ts": "A generic hook that persists state to localStorage under a given key, providing state, a setter, and a clearDraft function that removes the stored value and resets to the initial value.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality via DFINITY's AuthClient, exposing identity, login status flags, and a React context provider component.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations (mass schedule, spiritual message, prayers, media gallery, announcements), wrapping actor calls in typed useQuery and useMutation hooks with cache invalidation.",
  "frontend/src/hooks/useScrollAnimation.ts": "A hook that uses IntersectionObserver to set an isVisible flag when the referenced element scrolls into view, then stops observing it.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind, and defines a sacred-themed design system with CSS custom properties for colors (navy, gold, ivory), typography utilities, and component classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a collapsible sidebar for navigating between four management modules (Mass Schedule, Spiritual Message, Media Gallery, Announcements) and a logout button.",
  "frontend/src/pages/AdminLogin.tsx": "Renders the admin login page with a password input form, show/hide toggle, and error display; on success redirects to /admin using the auth utility.",
  "frontend/src/pages/LandingPage.tsx": "Composes the full church landing page by assembling all section components (Navbar, Hero, Announcements, MassSchedule, etc.) in order.",
  "frontend/src/utils/auth.ts": "Provides login, logout, and isAuthenticated helpers using localStorage; hardcodes the admin password and clears draft keys on logout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the church site's custom color palette (navy, ivory, gold), typography (Playfair Display, Cinzel, Lato), shadows, animations, and plugin setup.",
  "project_state.json": "Tracks overall project state including architecture notes (Next.js, local JSON DB, admin auth), existing features, known issues, and image requirements for the Holy Rosary Church website."
}