{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Holy Rosary Catholic Church — Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Build professional single-page landing site with all required sections: Navbar, Hero, Announcements Banner, Daily Mass Schedule, Daily Spiritual Message, Prayer Module, Church Media Gallery, Online Donation CTA, Google Map, and Footer",
      "acceptanceCriteria": [
        "All sections are visible on the landing page in the specified order.",
        "Church name 'Parishudda Japamaala Maatha Devalayamu (Holy Rosary Catholic Church)' appears in the hero and footer.",
        "The page is fully responsive."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and compose all landing page sections in the specified order: Navbar, Hero, AnnouncementsBanner, MassSchedule, SpiritualMessage, PrayerModule, MediaGallery, DonationCTA, GoogleMap, Footer. Wrap sections in a main container with proper spacing."
        },
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "create",
          "description": "Create navigation bar component displaying church name 'Parishudda Japamaala Maatha Devalayamu (Holy Rosary Catholic Church)' and anchor links to each page section. Implement smooth scroll behavior for navigation links."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "create",
          "description": "Create hero section with church name heading, descriptive tagline, and background image using the generated asset at frontend/public/assets/generated/church-hero.dim_1920x1080.png. Include dark gradient overlay for text legibility."
        },
        {
          "path": "frontend/src/components/AnnouncementsBanner.tsx",
          "operation": "create",
          "description": "Create announcements banner component that fetches data from backend.getAnnouncement(). Display highlight text and event date. Only render when active flag is true. Position below Navbar."
        },
        {
          "path": "frontend/src/components/MassSchedule.tsx",
          "operation": "create",
          "description": "Create mass schedule section that fetches data from backend.getMassSchedule(). Display timings in a responsive table or card grid showing Day, Time, and Service Type fields."
        },
        {
          "path": "frontend/src/components/SpiritualMessage.tsx",
          "operation": "create",
          "description": "Create spiritual message section that fetches data from backend.getSpiritualMessage(). Display card with Title, Author, preview text, and Date. Include 'Read More' button to trigger modal."
        },
        {
          "path": "frontend/src/components/SpiritualMessageModal.tsx",
          "operation": "create",
          "description": "Create modal component using Framer Motion for smooth animation. Display full spiritual message text with close button. Receives message data as props from SpiritualMessage component."
        },
        {
          "path": "frontend/src/components/PrayerModule.tsx",
          "operation": "create",
          "description": "Create prayer module section with language filter (Telugu/English toggle). Fetch prayers using backend.getPrayersByLanguage(language). Use React state to manage selected language and filter displayed prayers in real time. Display prayers as cards or list."
        },
        {
          "path": "frontend/src/components/MediaGallery.tsx",
          "operation": "create",
          "description": "Create church media gallery section that fetches data from backend.getMediaGallery(). Render responsive grid displaying images and YouTube video embeds with captions. For YouTube URLs, use iframe embeds. For image URLs, render img elements."
        },
        {
          "path": "frontend/src/components/DonationCTA.tsx",
          "operation": "create",
          "description": "Create online donation call-to-action section with prominent button/link. Style with pulse animation as specified in REQ-2. This is a visual CTA only, not a payment gateway integration."
        },
        {
          "path": "frontend/src/components/GoogleMap.tsx",
          "operation": "create",
          "description": "Create Google Map section displaying church address in Nellore and a prominent 'View on Google Maps' button linking to https://share.google/RgB7sMob1CDcBHUIp with target='_blank'."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "create",
          "description": "Create footer section displaying church name 'Parishudda Japamaala Maatha Devalayamu (Holy Rosary Catholic Church)', contact information, and copyright notice. Include church logo at frontend/public/assets/generated/church-logo.dim_256x256.png."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply sacred, professional holy visual theme with deep navy/midnight blue, warm ivory/cream, and gold (#D4AF37) accents. Use Playfair Display for headings, add gradient overlay on Hero, gold borders on cards, scroll animations, and pulse animation on Donation button",
      "acceptanceCriteria": [
        "Gold (#D4AF37) accent color is consistently applied.",
        "Playfair Display font is used for all section headings.",
        "Hero section has a dark gradient overlay ensuring white text is legible.",
        "Scroll-triggered slide-up animations are active on each section.",
        "Donation button visibly pulses."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Import Playfair Display font from Google Fonts. Define CSS custom properties for theme colors: --navy (deep navy/midnight blue), --ivory (warm cream), --gold (#D4AF37). Define utility classes for gold borders, gradient overlays, and pulse animation for the donation button."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with custom colors (navy, ivory, gold: #D4AF37) and font family (Playfair Display for headings). Add keyframes for pulse and slideUp animations."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Add linear-gradient(to bottom, rgba(0,0,0,0.7), transparent) overlay on background image using CSS or inline styles. Ensure white text is legible over the gradient."
        },
        {
          "path": "frontend/src/components/MassSchedule.tsx",
          "operation": "modify",
          "description": "Apply gold border (#D4AF37) styling to mass timing cards. Add scroll-triggered slide-up animation using Intersection Observer or Framer Motion."
        },
        {
          "path": "frontend/src/components/SpiritualMessage.tsx",
          "operation": "modify",
          "description": "Apply gold border (#D4AF37) styling to spiritual message card. Add scroll-triggered slide-up animation using Intersection Observer or Framer Motion."
        },
        {
          "path": "frontend/src/components/DonationCTA.tsx",
          "operation": "modify",
          "description": "Apply subtle CSS pulse animation to the donation button using the keyframes defined in Tailwind config or custom CSS."
        },
        {
          "path": "frontend/src/hooks/useScrollAnimation.ts",
          "operation": "create",
          "description": "Create custom React hook using Intersection Observer API to trigger slide-up animations when sections enter viewport. Return ref and animation state for components to consume."
        },
        {
          "path": "frontend/src/components/PrayerModule.tsx",
          "operation": "modify",
          "description": "Add scroll-triggered slide-up animation using useScrollAnimation hook or Framer Motion."
        },
        {
          "path": "frontend/src/components/MediaGallery.tsx",
          "operation": "modify",
          "description": "Add scroll-triggered slide-up animation using useScrollAnimation hook or Framer Motion."
        },
        {
          "path": "frontend/src/components/AnnouncementsBanner.tsx",
          "operation": "modify",
          "description": "Apply gold accent color (#D4AF37) to announcement banner styling."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement scroll-aware Navbar that transitions from transparent to solid deep navy background when scrolled past 50px, with smooth anchor scrolling to page sections",
      "acceptanceCriteria": [
        "Navbar is transparent at the top of the page.",
        "Navbar background becomes solid navy when scrolled > 50px.",
        "Navigation links anchor-scroll to their respective sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Use useEffect hook to track window.scrollY position. Add event listener for scroll events. Toggle background class from transparent to solid navy (bg-blue-900 or custom navy color) when scrollY > 50. Implement smooth anchor scrolling for navigation links using scrollIntoView with smooth behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create Daily Mass Schedule section displaying mass timings from backend with Day, Time, and Service Type fields, seeded with default Sunday masses",
      "acceptanceCriteria": [
        "Mass schedule is displayed on the landing page.",
        "Default seed data (Sunday 6:30 AM Telugu Mass, Sunday 8:30 AM English Mass) is visible on first load.",
        "Data updates made in the admin panel are reflected on the landing page after saving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MassSchedule.tsx",
          "operation": "modify",
          "description": "Fetch mass schedule data from backend.getMassSchedule() on component mount using useEffect. Store in React state. Map over data to render responsive table or card list with Day, Time, and Service Type columns. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create Daily Spiritual Message section with expandable 'Read More' modal displaying Title, Author, Full Text, and Date",
      "acceptanceCriteria": [
        "Spiritual message card is visible on the landing page.",
        "Clicking 'Read More' opens a modal with the full message text.",
        "Modal can be dismissed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SpiritualMessage.tsx",
          "operation": "modify",
          "description": "Fetch spiritual message data from backend.getSpiritualMessage() on component mount using useEffect. Store in React state. Display Title, Author, truncated preview text, and formatted Date. Add 'Read More' button that toggles modal visibility state. Pass full message data to SpiritualMessageModal component."
        },
        {
          "path": "frontend/src/components/SpiritualMessageModal.tsx",
          "operation": "modify",
          "description": "Implement modal with Framer Motion animations (fade in/slide up). Display full spiritual message text with Title, Author, Full Text, and Date. Include close button that triggers onClose callback to hide modal. Add backdrop click handler to dismiss modal."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create Prayer Module with language filter toggle (Telugu/English) that filters prayers in real time using React state",
      "acceptanceCriteria": [
        "Language filter (Telugu / English) is visible and functional.",
        "Selecting a language filters the displayed prayers instantly.",
        "At least 2 sample prayers per language are seeded."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PrayerModule.tsx",
          "operation": "modify",
          "description": "Add language filter UI (toggle buttons or dropdown for Telugu/English). Use useState hook to track selected language. Fetch filtered prayers from backend.getPrayersByLanguage(language) whenever language selection changes using useEffect with language as dependency. Display prayers as cards or list showing title and content."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create Church Media Gallery displaying images and YouTube video embeds with captions in a responsive grid, reading from backend state",
      "acceptanceCriteria": [
        "Media gallery renders images and YouTube embeds in a responsive grid.",
        "Each item shows its caption.",
        "Content added via admin is reflected in the gallery after saving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MediaGallery.tsx",
          "operation": "modify",
          "description": "Fetch media items from backend.getMediaGallery() on component mount using useEffect. Store in React state. Map over items to render responsive grid. For each item, check mediaType: if 'image', render img element with url as src; if 'video' or 'youtube', render iframe with YouTube embed URL. Display caption below each media item. Handle loading and error states."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create Announcements Banner (below Navbar) that displays highlight text and event date only when Active toggle is true",
      "acceptanceCriteria": [
        "Banner is visible only when the Active toggle is enabled in admin.",
        "Banner shows highlight text and event date.",
        "Deactivating the banner in admin hides it on the landing page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AnnouncementsBanner.tsx",
          "operation": "modify",
          "description": "Fetch announcement data from backend.getAnnouncement() on component mount using useEffect. Store in React state. Conditionally render banner only if announcement exists and active flag is true. Display text and formatted eventDate (convert bigint timestamp to readable date). Position banner below Navbar and above Hero section."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Embed Google Map section with 'View on Google Maps' button linking to church location in Nellore",
      "acceptanceCriteria": [
        "A map section is present on the landing page.",
        "A clearly labeled button/link opens https://share.google/RgB7sMob1CDcBHUIp in a new tab.",
        "The church location in Nellore is mentioned in the section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GoogleMap.tsx",
          "operation": "modify",
          "description": "Display section heading, church address in Nellore, and a prominent 'View on Google Maps' button styled consistently with site theme. Button links to https://share.google/RgB7sMob1CDcBHUIp with target='_blank' and rel='noopener noreferrer'. Optionally include a decorative map placeholder image or icon."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Build protected Admin Dashboard at /admin route with hardcoded password authentication (ChurchofHolyRosary@2026), localStorage session persistence, and logout functionality",
      "acceptanceCriteria": [
        "Visiting /admin shows a login form if not authenticated.",
        "Entering password 'ChurchofHolyRosary@2026' grants access.",
        "Wrong password shows an error.",
        "Logged-in state persists across tab switches and page refreshes.",
        "Logout button clears the session and redirects to the login screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add React Router routes: '/' for landing page and '/admin' for admin dashboard. Wrap /admin route with ProtectedRoute component that checks authentication status before rendering AdminDashboard."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "create",
          "description": "Create login page with password input form. On submit, check if password matches 'ChurchofHolyRosary@2026'. If correct, set auth_session in localStorage and redirect to AdminDashboard. If incorrect, display error message. Use controlled input with useState for password field."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "create",
          "description": "Create admin dashboard layout with navigation to four management modules: Mass Schedule, Spiritual Message, Media Gallery, and Announcements. Include logout button in header that clears auth_session from localStorage and redirects to AdminLogin. Render the selected module based on internal navigation state."
        },
        {
          "path": "frontend/src/components/ProtectedRoute.tsx",
          "operation": "create",
          "description": "Create protected route wrapper component that checks for auth_session in localStorage. If session exists and is valid, render children (AdminDashboard). Otherwise, redirect to AdminLogin page. Use React Router Navigate for redirection."
        },
        {
          "path": "frontend/src/utils/auth.ts",
          "operation": "create",
          "description": "Create auth utility functions: isAuthenticated() checks localStorage for auth_session, login(password) validates password and sets session, logout() clears session from localStorage. Export these functions for use in AdminLogin and ProtectedRoute."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Build Admin Dashboard with four management modules: Mass Schedule (add/edit/delete), Spiritual Message (form), Media Gallery (upload images, add YouTube URLs, manage items), and Announcements (form with toggle). Each module persists data via backend canister calls",
      "acceptanceCriteria": [
        "All four modules are accessible from the admin dashboard.",
        "Clicking Save in any module calls the backend and persists the data.",
        "After saving, the landing page reflects the updated content.",
        "Media Gallery supports single file upload, bulk folder selection (via webkitdirectory), and YouTube URL input.",
        "Existing media items can be deleted from the gallery manager."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add internal navigation UI (tabs or sidebar) to switch between four modules: MassScheduleManager, SpiritualMessageManager, MediaGalleryManager, AnnouncementsManager. Use React state to track active module and conditionally render the corresponding component."
        },
        {
          "path": "frontend/src/components/admin/MassScheduleManager.tsx",
          "operation": "create",
          "description": "Create mass schedule management UI. Fetch existing schedule from backend.getMassSchedule() on load. Display list of current mass timings with edit and delete buttons. Include form to add new timing with Day, Time, Service Type fields. On save, call backend.addMassTiming(day, time, serviceType) and refresh the list. Implement delete by managing local state (since backend uses stable variable, deletions must be handled by resending the full updated array to a new backend update method if needed, or track deletions in UI state)."
        },
        {
          "path": "frontend/src/components/admin/SpiritualMessageManager.tsx",
          "operation": "create",
          "description": "Create spiritual message management form with fields: Title, Author, Full Text (textarea), and Date (auto-populated with current date or date picker). On save button click, call backend.updateSpiritualMessage(title, author, fullText) with current timestamp. Display success/error feedback. Load existing message from backend.getSpiritualMessage() on mount to populate form for editing."
        },
        {
          "path": "frontend/src/components/admin/MediaGalleryManager.tsx",
          "operation": "create",
          "description": "Create media gallery manager with three upload methods: (1) single file input for images, (2) folder input using webkitdirectory attribute for bulk upload, (3) YouTube URL input field. Use the blob-storage component's ExternalBlob class to handle image uploads. For images: convert to ExternalBlob using ExternalBlob.fromBytes(), get URL with getDirectURL(), then call backend.addMediaItem('image', url, caption). For YouTube: call backend.addMediaItem('video', youtubeUrl, caption). Display existing media items fetched from backend.getMediaGallery() with delete buttons. Verify the blob-storage component's usage instructions before implementing. Include upload progress tracking using ExternalBlob.withUploadProgress()."
        },
        {
          "path": "frontend/src/components/admin/AnnouncementsManager.tsx",
          "operation": "create",
          "description": "Create announcements management form with fields: Highlight Text (textarea), Event Date (date picker), and Active toggle (checkbox or switch). Load existing announcement from backend.getAnnouncement() on mount to populate form. On save, call backend.updateAnnouncement(text, eventDate, active) with eventDate converted to bigint timestamp. Display success/error feedback."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Persist unsaved admin form draft state in localStorage so form data is retained when switching tabs or navigating away, cleared only on logout or successful save",
      "acceptanceCriteria": [
        "Switching browser tabs and returning to /admin shows all previously entered (unsaved) form data intact.",
        "Refreshing the admin page restores unsaved draft data.",
        "Logging out clears all draft data from localStorage.",
        "Saving successfully also clears the draft for that module."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDraftState.ts",
          "operation": "create",
          "description": "Create custom React hook useDraftState(key, initialValue) that syncs form state with localStorage. On mount, load saved draft from localStorage[key] if exists, otherwise use initialValue. On state change, save to localStorage. Provide clearDraft() function to remove from localStorage. Return [state, setState, clearDraft]."
        },
        {
          "path": "frontend/src/components/admin/MassScheduleManager.tsx",
          "operation": "modify",
          "description": "Replace useState with useDraftState('massScheduleDraft', initialState) to persist form inputs. Call clearDraft() on successful save. Ensure logout flow in AdminDashboard clears this draft."
        },
        {
          "path": "frontend/src/components/admin/SpiritualMessageManager.tsx",
          "operation": "modify",
          "description": "Replace useState with useDraftState('spiritualMessageDraft', initialState) to persist form inputs. Call clearDraft() on successful save. Ensure logout flow in AdminDashboard clears this draft."
        },
        {
          "path": "frontend/src/components/admin/MediaGalleryManager.tsx",
          "operation": "modify",
          "description": "Use useDraftState('mediaGalleryDraft', initialState) to persist YouTube URL input and caption fields. Call clearDraft() after successful media addition. Ensure logout flow in AdminDashboard clears this draft. Note: File inputs cannot be persisted in localStorage; only text fields."
        },
        {
          "path": "frontend/src/components/admin/AnnouncementsManager.tsx",
          "operation": "modify",
          "description": "Replace useState with useDraftState('announcementDraft', initialState) to persist form inputs. Call clearDraft() on successful save. Ensure logout flow in AdminDashboard clears this draft."
        },
        {
          "path": "frontend/src/utils/auth.ts",
          "operation": "modify",
          "description": "Update logout() function to clear all draft localStorage keys (massScheduleDraft, spiritualMessageDraft, mediaGalleryDraft, announcementDraft) in addition to clearing auth_session."
        }
      ]
    }
  ]
}